 <template>
  <div class="protocol-wrap">
    <div class="top">
      <span class="protocol-title">
        <img alt class="protocol-icon" src="./img/protocol.png" />
        <span class="title">购买卡片协议</span>
      </span>
      <button @click="back" class="back-button"></button>
    </div>
    <span class="center">
      <div class="paper">
        <span class="paper-line l1"></span>
        <span class="paper-line l2"></span>
        <span class="paper-line l3"></span>
        <span class="paper-line l4"></span>
        <span class="paper-line l5"></span>
        <span class="paper-block"></span>
        <div class="pen">
          <div class="pen-t"></div>
          <div class="pen-m"></div>
          <div class="pen-b" style="transition: background 0.2s ease 0s;"></div>
        </div>
      </div>
      <span class="center-name">卡片协议</span>
      <div class="quote-r">
        <div class="quote-r-bg">
          <span class="quote-r-dot d1"></span>
          <span class="quote-r-dot d2"></span>
          <span class="quote-r-dot d3"></span>
        </div>
      </div>
    </span>
    <span class="protocol">
      <span class="protocol_headline">第一章&nbsp;&nbsp;总则</span>
      <p>1. 本健身馆名称为无竞悦动健身俱乐部（以下简称本馆）。</p>
      <p>2. 本馆成立之宗旨为增进身心健康，提倡健身运动及正常休闲运动。为确保会员获得安全、舒适的健身体验，会员须遵守本馆相关的规章制度。</p>
      <p>3. 本章程是会员合约的组成部分，本章程所声明内容会员须义务遵守。</p>
      <p>4. 在法律允许的范围内，本馆对本章程的内容有最终解释权，同时为更好地服务会员之需要，本馆有权对相关内容进行修改，且将修改后的条款张贴在场馆内或在本馆网站、APP，微信公众号或其他传播渠道显著位置公示后，即对全体会员产生约束力。</p>
      <p>5. 如有会员违反本章程，本馆可在出具书面通知或在馆内张贴通告后，终止与其的会员合约和其他使用设施的权利，本馆不承担将来引发的义务，也不承担退款的义务。</p>
      <span class="protocol_headline">第二章&nbsp;&nbsp;会员卡</span>
      <p>1. 无竞悦动健身采用会员制服务模式，只有取得会员卡方能享受本馆的各项专业健身服务及相关配套服务。</p>
      <p>2. 取得会员资格应办理入会手续，并充分知晓本馆有关健身的规则与警示，承诺遵守本馆的相关规定。</p>
      <p>3. 因经营管理需要，本馆可能会针对不同客户办理不同类别的电子会员卡，但无论您持有何种电子会员卡，都将在享受会员权利的同时，受到本章程的约束。</p>
      <p>4. 本章程所称“会员”是指年满16周岁未满60周岁身体健康并向本馆缴纳了全部会费，能如实提供和陈述个人信息，取得本馆发放的电子会员卡的人士。因此您有义务对入会时所提供资料的真实性、合法性负责。</p>
      <p>5. 电子会员卡的取得方式</p>
      <p>1）线上签约，指在微信公众账号“AMPM无竞悦动健身”和“无竞悦动健身自由馆”注册、填写真实、有效、全面的个人资料，办理入会手续并缴纳会费后取得会员资格。</p>
      <p>2）线下签约，指通过线下签订会员或私教协议，提供真实、有效、全面的个人资料，办理入会手续并缴纳会费后取得会员资格。</p>
      <span class="protocol_headline">第三章&nbsp;&nbsp;会员的权利</span>
      <p>1. 会员根据自身会籍类型的不同，享有使用本馆对该类卡会员提供的全部服务的权利。</p>
      <p>2. 针对本馆的服务，会员有提出批评、投诉及改进建议的权利。</p>
      <p>3. 会籍期满后会员有优先续约的权利。</p>
      <span class="protocol_headline">第四章&nbsp;&nbsp;会员的义务</span>
      <p>1. 如实向无竞悦动健身俱乐部提供个人信息资料，并在资料发生变动后及时通知。</p>
      <p>2. 会员卡仅限本人使用，凭电子会员卡进入健身馆，且随时接受工作人员验证和抽查。</p>
      <p>3. 如会员对本馆设施造成破坏，须照价赔偿，通过维修可以恢复使用功能的赔偿维修费，损害严重需更换的按同质量设施的市场价格赔偿。</p>
      <p>4. 为了您锻炼的安全，请穿着运动服饰、运动鞋参加运动，本馆禁止会员赤裸上身或穿着皮鞋、高跟鞋、拖鞋、裙子、睡衣及其他不适合锻炼的服饰进入锻炼区域，如不遵守规定进行锻炼，因此出现的后果由会员全部承担，工作人员有权劝离并取消当日运动权利。</p>
      <p>5. 会员若违反下列规定，本馆有权利终止其会员资格。</p>
      <p>1）毁损本馆名誉；</p>
      <p>2）屡次违反本馆规章制度；</p>
      <p>3）屡次扰乱本馆的经营秩序；</p>
      <p>4）因违法犯罪行为受到法律制裁；</p>
      <p>5）故意毁坏本馆设施；</p>
      <p>6）寻衅滋事及其他破坏本馆安全的行为。</p>
      <p>6. 出于安全考虑，无竞悦动智享馆谢绝14岁以下儿童进入场馆，会员也请勿自己带领儿童入馆，对于擅自进入健身区域造成伤害或损失的，本馆概不负责。</p>
      <p>7. 本馆内禁止吸烟、吐痰、乱扔垃圾，严禁在健身区域进食，请自觉维护本馆的环境卫生。</p>
      <p>8. 严禁携带宠物进入本馆。</p>
      <p>9. 会员入会前应当对自己的健康状况进行检查，自行确认自己的健康状况良好，有能力参加本馆的各项活动，如有不适合本馆活动项目的，应如实申报。严禁心肺功能疾病、脊椎病、皮肤病及一切传染病患者进入本馆健身，有以上疾病的患者隐瞒病情取得会员资格的，本馆有权终止其资格，并保留追究其法律责任的权利。隐瞒病情和不良的健康状况而在本馆进行健身而造成后果的，由会员自行承担相应的责任，本馆不负责赔偿。</p>
      <p>10. 本馆原则上不接受60岁以上老人入会，能出具真实有效的健康证明者除外，但因隐瞒或错报个人健康信息发生的一切责任都由其本人承担。</p>
      <p>11. 吸食毒品者不得入会，因隐瞒吸食毒品史而入会的，一经发现立刻取消会员资格，所有费用不予退还，造成后果的由其本人自行承担，本馆概不负责。</p>
      <p>12. 禁止会员在本馆内销售任何商品，不得参与任何营利性健身指导，违反本条规定的，本馆有权取消其会员资格。</p>
      <p>13. 未征得本馆负责人同意，禁止在本馆内拍照、摄像或录音。</p>
      <p>14. 安全锻炼：</p>
      <p>1）运动前严禁饮酒或饮用含酒精类饮料，因违反本条规定造成的人身伤害等意外情况，责任由其自行承担，本馆概不负责。</p>
      <p>2）会员在锻练前，应先做必要的热身练习，以免受伤。</p>
      <p>3）过度锻炼及违规锻炼均有受伤的可能，所以会员应在运动前对自身身体情况进行判断， 并保持适当的运动强度和运动时间。如会员过度运动或在身体不适的情况下强行运动而导致的任何伤害本馆概不负责。</p>
      <p>4）健身馆内任何运动项目及器械设施均有严格的操作方法和程序，会员务必在专业人员的指导下或者安全手册下进行操作，会员承诺有责任在学习并知晓正确的操作方法及注意事项后进行锻炼，同时应充分注意自己的身体状况及承受能力，否则因此发生的任何的损害由会员本人自行承担。</p>
      <p>5）由于运动出汗后立即淋浴容易导致大脑供血不足、虚脱、内分比失调、风湿等问题，会员应在运动后30分钟再进行淋浴。</p>
      <p>15. 会员应自觉爱惜合理使用室内各项设施、设备、使用后须归放原位，如有损坏须照价赔偿。</p>
      <p>16. 会员在进入本馆时应保管好自己的私人物品，并在结束运动后将自己的私人物品带离场馆，本馆不负保管义务，由于会员疏忽和遗忘而未能及时将私人物品带走而发生遗失的，损失由会员自行承担。</p>
      <p>17. 严禁在本馆内大声喧哗，使用污秽语言以及一切违法活动。</p>
      <p>18. 本馆禁止会员间和会员与公司员工间的损害本馆利益的经济交易（例如：私人教学、营养品等），如发生上述情况本公司对私自交易的所有内容不承担任何责任，会员购买私人教学或营养品等，必须向公司专门的销售部门购买。</p>
      <p>19. 对违反本章程约定从而造成物品丢失及人员伤亡的，由会员自行承担。</p>
      <p>20. 本馆正式运营后，如因政府法律变更、战乱等不可抗力致无法经营时，经本公司董事会议后宣布解散，本馆将剩余会员使用时长按比例退还会员费。</p>
      <p>21. 本馆及所属员工对会员之一切承诺，会员必须要求以书面形式记录在会员资格申请表，无公司印章或公司法定代表人签署的承诺无效。</p>
      <p>22. 因会员或同行亲友不当使用健身设备，造成器械设备损害或其他人员伤害的，会员承担连带损害赔偿责任，当事人之一违反本契约致另一方受到损害者，应付损害赔偿责任。</p>
      <span class="protocol_headline">第五章&nbsp;&nbsp;权利保留</span>
      <p>1. 本馆营业时间原则上为24小时，因国家政策或者法律法规的规定，本馆有权合理修改营业时间并在店内公示。营业时间如有变动，本馆将在微信公众账号后台以及门店做显著位置公示，该公示即视为通知，会员须遵守该营业时间。</p>
      <p>2. 因经营管理需要，本馆有权调整、增减部分项目，该行为不视为违约，且在店内公示后即视为通知，无需另行报告给会员个人。</p>
      <p>3. 因器械、设备（设施）检修、维护，本馆有权在某一时间段对某一项目或某类项目采取停用或限用措施。</p>
      <p>4. 其他出于会员安全及集体利益的需要，本馆有权采取必要措施以恢复经营秩序。</p>
      <span class="protocol_headline">第六章&nbsp;&nbsp;会员声明</span>
      <p>1. 本人保证所提供的入会资料及个人信息真实有效；</p>
      <p>2. 本人身体健康且没有本协议约定的不适合进行运动的疾病；</p>
      <p>3. 本人已阅读、理解并同意上述条款。</p>
      <span class="protocol_headline">第七章&nbsp;&nbsp;合同的终止与会员权益转让</span>
      <p>1. 会员购买年卡以上服务项目，因下列情形之一可申请暂停会员权益，每年可享受两次停卡服务。每次停卡时间1个月以上，全年累计不超过3个月，停卡手续费100元/次；（因会员怀孕，提供医院证明后可特殊享受免费停卡12个月的服务）。</p>
      <p>1）出差，提供交通票据证明；</p>
      <p>2）因病或受伤不宜运动者（附医院证明）；</p>
      <p>3）因职务调动或其他重大事导致难以继续行使会员权益。</p>
      <p>4）因重大流行性传染病发生，且会员处于主管机关公告之疫区内的。</p>
      <p>2. 会员权益转让：会员如果无法行使本场馆会员卡的权利，需要转让给第三方的，需提交书面申请，并与乙方协商，经过乙方书面同意之后，办理转让手续，转让手续费为300元整。 赠送的时间不在转卡时间范围内。</p>
      <span class="protocol_headline">第八章&nbsp;&nbsp;其他</span>
      <p>&nbsp;&nbsp;&nbsp;如果会员和本馆因协议的履行发生争议，双方首先应当协商解决，如果协商不成的，任何一方均可以向签约地人民法院起诉解决争议。</p>
    </span>
  </div>
</template>
<script>
import './style.stylus'
import param from '@utils/url-param'
import go from '@utils/goto'
import './cardProtocol.styl'

export default {
  data() {
    return {
      show: false
    }
  },
  methods: {
    back() {
      window.history.go(-1)
    }
  },
  created() {}
}
</script>